# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [3]:
import pandas as pd


s1 = pd.Series([4, 8, 15, 16, 23,42])

In [4]:
s1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [6]:
my_list = [1, 3, 5, 7, 9, 2, 4, 6, 8, 10]
my_series = pd.Series(my_list)
print(my_series)

0     1
1     3
2     5
3     7
4     9
5     2
6     4
7     6
8     8
9    10
dtype: int64

# Q3. Create a Pandas DataFrame that contains the following data: then print it

In [9]:
df = pd.DataFrame({'name':['Alice' ,'Bob' , 'Claire'],'age':[25,30,27] , 'gender': ['female','male','female']})
df

     name  age  gender
0   Alice   25  female
1     Bob   30    male
2  Claire   27  female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [12]:
# in python dataframe is two-dimenstional data structure that can hold data from diffrent types. it is tebular data structure similar to spreadsheet or SQL table where data is orgnised in rows and columns  is column in pandas dataframe is a series 
#  A dataframe can be created using varios sources  such as list , dictonary , Numpy Arrays or other pandas data structure , it provides many powerful methods for manipulating and anylizing data .

# Here's an example of creating a Pandas DataFrame from a dictionary of lists:
data  = {
    'Name' : ['prash' , 'pankaj' , 'pratik' ],
    'age': [21,22,23],
    'Gender' : ['M','F' ,'M' ]
}

df = pd.DataFrame(data)

In [13]:
df

     Name  age Gender
0   prash   21      M
1  pankaj   22      F
2  pratik   23      M

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [16]:
# python provides wide range of function for manipulating data in dataframe . some common function include 

# 1. head() and tail() : these function are used view the first or last n rows of the dataframe , respectively
df.head(2)

     Name  age Gender
0   prash   21      M
1  pankaj   22      F

In [18]:
df.tail(2)

     Name  age Gender
1  pankaj   22      F
2  pratik   23      M

In [20]:
# 2 descibe() :this function generate the statactical summury of a dataframe .it can be used for overall view of the data 
df.describe()

        age
count   3.0
mean   22.0
std     1.0
min    21.0
25%    21.5
50%    22.0
75%    22.5
max    23.0

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

## the pandas series and dataframe are mutable in nature while the panels are inmutable data structure in pnadas .

# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [22]:
s1 = pd.Series(['prash' , 'pankaj' , 'pratik' ])
s2 = pd.Series([21,22,23])
s3 = pd.Series(['M','F' ,'M' ])

df1 = pd.DataFrame({'Name' :s1,'Age': s2,'Gender':s3})
df1

     Name  Age Gender
0   prash   21      M
1  pankaj   22      F
2  pratik   23      M

## In this example, we created three Pandas Series objects (s1, s2, and s3) to represent the columns of our DataFrame. We then combined these Series objects into a DataFrame using the pd.DataFrame() function, passing a dictionary of column names and Series objects as the argument.